test/xquery-update-10-test-suite/ExpectedTestResults/UseCases/SoapUpdates/soap-q1-results.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"> 
 <env:Header>
  <m:reservation xmlns:m="http://travelcompany.example.org/reservation" env:mustUnderstand="true" env:role="http://www.w3.org/2003/05/soap-envelope/role/next">
   <m:reference>uuid:093a2da1-q345-739r-ba5d-pqff98fe8j7d
   </m:reference>
   <m:dateAndTime>2007-08-16T22:57:20+01:00</m:dateAndTime>
  </m:reservation>
  <n:passenger xmlns:n="http://mycompany.example.com/employees" env:mustUnderstand="true" env:role="http://www.w3.org/2003/05/soap-envelope/role/next">
   <n:name>Åke Jógvan Øyvind</n:name>
  </n:passenger>
 </env:Header>
 <env:Body><p:itineraryClarification xmlns:p="http://travelcompany.example.org/reservation/travel"><p:departure><p:departing><airportChoices>JFK   LGA   EWR  </airportChoices></p:departing><p:arriving/></p:departure><p:return><p:departing/><p:arriving><airportChoices>JFK   LGA   EWR  </airportChoices></p:arriving></p:return></p:itineraryClarification></env:Body>
</env:Envelope>